openfoam_practice/00_install_check/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  설치 검증: 2D 평행평판 층류 (Poiseuille 유동, 해석해 있음)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;
