openfoam_practice/00_install_check/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  설치 검증: 2D 평행평판 층류 (Poiseuille 유동, 해석해 있음)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p { solver GAMG; smoother GaussSeidel; tolerance 1e-08; relTol 0.01; }
    U { solver smoothSolver; smoother GaussSeidel; tolerance 1e-08; relTol 0.1; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;
    residualControl { p 1e-06; U 1e-07; }
}
relaxationFactors
{
    equations { U 0.9; }
    fields    { p 1; }
}
